app/Controllers/Admin/DashboardStats.php

    public function stats()
    {
        $patientModel = new AdminPatientModel();
        $scheduleModel = new ScheduleModel();
        $labRequestModel = new LabRequestModel();
        $billingModel = new BillingModel();

        // Get dashboard statistics
        $totalDoctors = $this->getTotalDoctors();
        $totalPatients = $patientModel->countAllResults();

        $today = date('Y-m-d');
        $todaysAppointments = $scheduleModel
            ->where('date', $today)
            ->countAllResults();

        $pendingBills = $billingModel
            ->where('status', 'pending')
            ->countAllResults();

        // Get pending lab requests from nurses
        $pendingLabRequests = $labRequestModel
            ->select('lab_requests.*, admin_patients.firstname, admin_patients.lastname, users.username as nurse_name')
            ->join('admin_patients', 'admin_patients.id = lab_requests.patient_id', 'left')
            ->join('users', 'users.id = lab_requests.nurse_id', 'left')
            ->where('lab_requests.status', 'pending')
            ->where('lab_requests.requested_by', 'nurse')
            ->orderBy('lab_requests.created_at', 'DESC')
            ->limit(10)
            ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `admin_patients`
WHERE `admin_patients`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `schedules`
WHERE `date` = '2025-12-04'
AND `schedules`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `billing`
WHERE `status` = 'pending'
AND `billing`.`deleted_at` IS NULL
SELECT `lab_requests`.*, `admin_patients`.`firstname`, `admin_patients`.`lastname`, `users`.`username` as `nurse_name`
FROM `lab_requests`
LEFT JOIN `admin_patients` ON `admin_patients`.`id` = `lab_requests`.`patient_id`
LEFT JOIN `users` ON `users`.`id` = `lab_requests`.`nurse_id`
WHERE `lab_requests`.`status` = 'pending'
AND `lab_requests`.`requested_by` = 'nurse'
ORDER BY `lab_requests`.`created_at` DESC
 LIMIT 10

            ->countAllResults();

        // Get recent activity from schedules
        $recentActivity = $scheduleModel
            ->select('schedules.*, admin_patients.firstname as patient_first_name, admin_patients.lastname as patient_last_name, users.username as doctor')
            ->join('admin_patients', 'admin_patients.id = schedules.patient_id', 'left')
            ->join('users', 'users.id = schedules.doctor', 'left')
            ->orderBy('schedules.created_at', 'DESC')
            ->limit(10)
            ->findAll();
---
SELECT `schedules`.*, `admin_patients`.`firstname` as `patient_first_name`, `admin_patients`.`lastname` as `patient_last_name`, `users`.`username` as `doctor`
FROM `schedules`
LEFT JOIN `admin_patients` ON `admin_patients`.`id` = `schedules`.`patient_id`
LEFT JOIN `users` ON `users`.`id` = `schedules`.`doctor`
WHERE `schedules`.`deleted_at` IS NULL
ORDER BY `schedules`.`created_at` DESC
 LIMIT 10

    private function getTotalDoctors()
    {
        $db = \Config\Database::connect();
        if ($db->tableExists('users')) {
            return $db->table('users')->where('role_id', 2)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role_id` = 2