app/Controllers/Admin/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `admin_patients`
WHERE `admin_patients`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `schedules`
WHERE `date` = '2025-12-04'
AND `schedules`.`deleted_at` IS NULL
SELECT `schedules`.*, `admin_patients`.`firstname` as `patient_first_name`, `admin_patients`.`lastname` as `patient_last_name`, `users`.`username` as `doctor`
FROM `schedules`
LEFT JOIN `admin_patients` ON `admin_patients`.`id` = `schedules`.`patient_id`
LEFT JOIN `users` ON `users`.`id` = `schedules`.`doctor`
WHERE `schedules`.`deleted_at` IS NULL
ORDER BY `schedules`.`created_at` DESC
 LIMIT 10
SELECT `lab_requests`.*, `admin_patients`.`firstname`, `admin_patients`.`lastname`, `users`.`username` as `nurse_name`
FROM `lab_requests`
LEFT JOIN `admin_patients` ON `admin_patients`.`id` = `lab_requests`.`patient_id`
LEFT JOIN `users` ON `users`.`id` = `lab_requests`.`nurse_id`
WHERE `lab_requests`.`status` = 'pending'
AND `lab_requests`.`requested_by` = 'nurse'
ORDER BY `lab_requests`.`created_at` DESC
 LIMIT 10
---
    public function index()
    {
        // Load models for dashboard stats
        $patientModel = new \App\Models\AdminPatientModel();

        // Get dashboard statistics
        $totalDoctors = $this->getTotalDoctors();
        $totalPatients = $patientModel->countAllResults();

        // Get today's appointments from schedules
        $scheduleModel = new \App\Models\ScheduleModel();
        $todaysAppointments = $scheduleModel
            ->where('date', date('Y-m-d'))
            ->countAllResults();
        $pendingBills = $this->getPendingBills();

        // Get recent activity from schedules
        // Join with doctors table to get doctor name from patient's assigned doctor
        $db = \Config\Database::connect();
        $recentActivity = $db->table('schedules')
            ->select('schedules.*, admin_patients.firstname as patient_first_name, admin_patients.lastname as patient_last_name,
                     COALESCE(doctors.doctor_name, schedules.doctor, "N/A") as doctor')
            ->join('admin_patients', 'admin_patients.id = schedules.patient_id', 'left')
            ->join('doctors', 'doctors.user_id = admin_patients.doctor_id', 'left')
            ->where('schedules.deleted_at IS NULL', null, false)
            ->orderBy('schedules.created_at', 'DESC')
            ->limit(10)
            ->get()
            ->getResultArray();

        // Get pending lab requests from nurses
        $labRequestModel = new \App\Models\LabRequestModel();
        $pendingLabRequests = $labRequestModel
            ->select('lab_requests.*, admin_patients.firstname, admin_patients.lastname, users.username as nurse_name')
            ->join('admin_patients', 'admin_patients.id = lab_requests.patient_id', 'left')
            ->join('users', 'users.id = lab_requests.nurse_id', 'left')
            ->where('lab_requests.status', 'pending')
            ->where('lab_requests.requested_by', 'nurse')
            ->orderBy('lab_requests.created_at', 'DESC')
            ->limit(10)
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `doctors`
---
    private function getTotalDoctors()
    {
        $db = \Config\Database::connect();
        if ($db->tableExists('doctors')) {
            return $db->table('doctors')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `billing`
WHERE `status` = 'pending'
---
    private function getPendingBills()
    {
        $db = \Config\Database::connect();
        if ($db->tableExists('billing')) {
            return $db->table('billing')
                ->where('status', 'pending')
                ->countAllResults();