app/Controllers/Admin/UserController.php

SELECT `users`.*, `roles`.`name` as `role_name`, `roles`.`description` as `role_description`
FROM `users`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
ORDER BY `users`.`created_at` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();

        // Get all users with their roles
        $users = $db->table('users')
            ->select('users.*, roles.name as role_name, roles.description as role_description')
            ->join('roles', 'roles.id = users.role_id', 'left')
            ->orderBy('users.created_at', 'DESC')
            ->get()->getResultArray();