app/Controllers/Receptionist/DashboardStats.php

SELECT COUNT(*) as cnt
FROM `patients`
WHERE `type` = 'Out-Patient'
SELECT COUNT(*) AS `numrows`
FROM `admin_patients`
WHERE `admin_patients`.`deleted_at` IS NULL
---
            // Count admin_patients (they don't have type, so count all as additional)
            // Note: admin_patients are separate, so we add them to totals
            if ($db->tableExists('admin_patients')) {
                $adminTotal = $adminPatientModel->countAllResults();

SELECT SUM(`amount`) AS `sum`
FROM `billing`
WHERE `status` = 'pending'
---

            // Pending payments amount
            if ($db->tableExists('billing')) {
                $pendingAmount = $billingModel->builder()
                    ->selectSum('amount', 'sum')
                    ->where('status', 'pending')
                    ->get()->getRow('sum');

SELECT `c`.*, `ap`.`firstname`, `ap`.`lastname`, `ap`.`contact`, `u`.`username` as `doctor_name`
FROM `consultations` `c`
LEFT JOIN `admin_patients` `ap` ON `ap`.`id` = `c`.`patient_id`
LEFT JOIN `users` `u` ON `u`.`id` = `c`.`doctor_id`
WHERE `c`.`for_admission` = 1
AND `c`.`type` = 'completed'
AND `c`.`status` = 'approved'
AND `c`.`deleted_at` IS NULL
ORDER BY `c`.`consultation_date` DESC
 LIMIT 5
---
            // Get pending admissions (consultations marked for admission but not yet admitted)
            $pendingAdmissions = [];
            if ($db->tableExists('consultations') && $db->tableExists('admin_patients')) {
                $pendingAdmissionsRaw = $db->table('consultations c')
                    ->select('c.*, ap.firstname, ap.lastname, ap.contact, u.username as doctor_name')
                    ->join('admin_patients ap', 'ap.id = c.patient_id', 'left')
                    ->join('users u', 'u.id = c.doctor_id', 'left')
                    ->where('c.for_admission', 1)
                    ->where('c.type', 'completed')
                    ->where('c.status', 'approved')
                    ->where('c.deleted_at', null)
                    ->orderBy('c.consultation_date', 'DESC')
                    ->limit(5)
                    ->get()
                    ->getResultArray();