app/Controllers/Receptionist/Patients.php

SELECT *
FROM `doctors`
SELECT *
FROM `departments`
---
    public function index()
    {
        $type = $this->request->getGet('type'); // In-Patient | Out-Patient
        $search = trim((string)$this->request->getGet('q'));

        $builder = $this->patientModel->builder();
        $builder->select('patients.*, doctors.doctor_name, departments.department_name')
                ->join('doctors', 'doctors.user_id = patients.doctor_id', 'left') // Fix: use user_id instead of id
                ->join('departments', 'departments.id = patients.department_id', 'left');

        if ($type && in_array($type, ['In-Patient', 'Out-Patient'])) {
            $builder->where('patients.type', $type);
        }
        if ($search !== '') {
            $builder->groupStart()
                    ->like('patients.full_name', $search)
                    ->orLike('patients.patient_id', $search)
                    ->orLike('doctors.doctor_name', $search)
                    ->groupEnd();
        }
        $builder->orderBy('patients.patient_id', 'DESC');
        $patients = $builder->get()->getResultArray();