app/Controllers/Nurse/PatientController.php

    public function view()
    {
        // Check if user is logged in and is a nurse
        if (!session()->get('logged_in') || session()->get('role') !== 'nurse') {
            return redirect()->to('/auth')->with('error', 'You must be logged in as a nurse to access this page.');
        }

        $patientModel = new AdminPatientModel();

        // Get all patients (nurses can view all patients)
        $patients = $patientModel
            ->orderBy('lastname', 'ASC')
            ->orderBy('firstname', 'ASC')
            ->findAll();
---
SELECT *
FROM `admin_patients`
WHERE `admin_patients`.`deleted_at` IS NULL
ORDER BY `lastname` ASC, `firstname` ASC