app/Controllers/LabStaff/DashboardStats.php

    public function stats()
    {
        // Check if user is logged in and is lab staff
        if (!session()->get('logged_in') || !in_array(session()->get('role'), ['labstaff', 'lab_staff', 'admin'])) {
            return $this->response->setJSON(['error' => 'Unauthorized'])->setStatusCode(401);
        }

        $db = \Config\Database::connect();
        $today = date('Y-m-d');
        $monthStart = date('Y-m-01');
        $monthEnd = date('Y-m-t');

        try {
            $labRequestModel = new LabRequestModel();
            $labResultModel = new LabResultModel();

            // Pending tests (only after payment is paid - accountant must process payment first)
            $pendingTests = $labRequestModel
                ->where('status', 'pending')
                ->where('payment_status', 'paid') // ONLY count after payment is PAID
                ->countAllResults();

            // Completed today
            $completedToday = $labRequestModel
                ->where('status', 'completed')
                ->where('DATE(updated_at)', $today)
                ->countAllResults();

            // Monthly tests
            $monthlyTests = $labRequestModel
                ->where('created_at >=', $monthStart)
                ->where('created_at <=', $monthEnd . ' 23:59:59')
                ->countAllResults();

            // Get completed today list
            $completedTodayList = $labRequestModel
                ->select('lab_requests.*, admin_patients.firstname, admin_patients.lastname')
                ->join('admin_patients', 'admin_patients.id = lab_requests.patient_id', 'left')
                ->where('lab_requests.status', 'completed')
                ->where('DATE(lab_requests.updated_at)', $today)
                ->orderBy('lab_requests.updated_at', 'DESC')
                ->limit(10)
                ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `lab_requests`
WHERE `status` = 'pending'
AND `payment_status` = 'paid'
SELECT COUNT(*) AS `numrows`
FROM `lab_requests`
WHERE `status` = 'completed'
AND DATE(updated_at) = '2025-12-03'
SELECT COUNT(*) AS `numrows`
FROM `lab_requests`
WHERE `created_at` >= '2025-12-01'
AND `created_at` <= '2025-12-31 23:59:59'
SELECT `lab_requests`.*, `admin_patients`.`firstname`, `admin_patients`.`lastname`
FROM `lab_requests`
LEFT JOIN `admin_patients` ON `admin_patients`.`id` = `lab_requests`.`patient_id`
WHERE `lab_requests`.`status` = 'completed'
AND DATE(lab_requests.updated_at) = '2025-12-03'
ORDER BY `lab_requests`.`updated_at` DESC
 LIMIT 10

                ->countAllResults();

            // Get urgent/stat tests count (only after payment is paid)
            $urgentTests = $db->table('lab_requests')
                ->join('charges', 'charges.id = lab_requests.charge_id', 'inner')
                ->whereIn('lab_requests.status', ['pending', 'in_progress', 'specimen_collected'])
                ->whereIn('lab_requests.priority', ['urgent', 'stat'])
                ->where('lab_requests.payment_status', 'paid')
                ->where('charges.status', 'paid')
                ->where('lab_requests.charge_id IS NOT NULL')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `lab_requests`
INNER JOIN `charges` ON `charges`.`id` = `lab_requests`.`charge_id`
WHERE `lab_requests`.`status` IN ('pending','in_progress','specimen_collected')
AND `lab_requests`.`priority` IN ('urgent','stat')
AND `lab_requests`.`payment_status` = 'paid'
AND `charges`.`status` = 'paid'
AND `lab_requests`.`charge_id` IS NOT NULL

                    ->where('lab_requests.status', 'pending')
                    ->groupEnd()
                ->orGroupStart()
                    // 2. Status = 'specimen_collected' or 'in_progress' (with_specimen tests that have been collected)
                    ->whereIn('lab_requests.status', ['specimen_collected', 'in_progress'])
                    ->groupEnd()
                ->orderBy('lab_requests.priority', 'ASC') // Urgent/Stat first
                ->orderBy('lab_requests.requested_date', 'ASC')
                ->orderBy('lab_requests.created_at', 'DESC')
                ->limit(10)
                ->get()
                ->getResultArray();
---
SELECT `lab_requests`.*, `admin_patients`.`firstname`, `admin_patients`.`lastname`, `doctor`.`username` as `doctor_name`, `nurse`.`username` as `nurse_name`, `charges`.`charge_number`, `charges`.`status` as `charge_status`
FROM `lab_requests`
LEFT JOIN `admin_patients` ON `admin_patients`.`id` = `lab_requests`.`patient_id`
LEFT JOIN `users` as `doctor` ON `doctor`.`id` = `lab_requests`.`doctor_id`
LEFT JOIN `users` as `nurse` ON `nurse`.`id` = `lab_requests`.`nurse_id`
INNER JOIN `charges` ON `charges`.`id` = `lab_requests`.`charge_id`
WHERE `lab_requests`.`status` != 'cancelled'
AND `lab_requests`.`payment_status` = 'paid'
AND `charges`.`status` = 'paid'
AND `lab_requests`.`charge_id` IS NOT NULL
AND   (
`lab_requests`.`status` = 'pending'
 )
OR   (
`lab_requests`.`status` IN ('specimen_collected','in_progress')
 )
ORDER BY `lab_requests`.`priority` ASC, `lab_requests`.`requested_date` ASC, `lab_requests`.`created_at` DESC
 LIMIT 10