app/Controllers/LabStaff/LabStaffController.php

SELECT COUNT(*) AS `numrows`
FROM `lab_requests`
WHERE `status` = 'pending'
---
    public function dashboard()
    {
        // Check if user is logged in and is lab staff
        $isLoggedIn = session()->get('isLoggedIn') || session()->get('logged_in');
        $userRole = session()->get('role');
        if (!$isLoggedIn || !in_array($userRole, ['labstaff', 'lab_staff', 'admin'])) {
            return redirect()->to('/auth')->with('error', 'You must be logged in as lab staff to access this page.');
        }

        $db = \Config\Database::connect();
        $today = date('Y-m-d');
        $monthStart = date('Y-m-01');

        // Get pending test requests
        $pendingTests = $this->labRequestModel
            ->where('status', 'pending')
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `lab_requests`
WHERE `status` IN ('pending','in_progress')
---
            ->countAllResults();

        // Get pending specimens (lab requests with status pending or in_progress)
        $pendingSpecimens = $this->labRequestModel
            ->whereIn('status', ['pending', 'in_progress'])
            ->countAllResults();