app/Controllers/LabStaff/LabStaffController.php

    public function dashboard()
    {
        // Check if user is logged in and is lab staff
        $isLoggedIn = session()->get('isLoggedIn') || session()->get('logged_in');
        $userRole = session()->get('role');
        if (!$isLoggedIn || !in_array($userRole, ['labstaff', 'lab_staff', 'admin'])) {
            return redirect()->to('/auth')->with('error', 'You must be logged in as lab staff to access this page.');
        }

        $db = \Config\Database::connect();
        $today = date('Y-m-d');
        $monthStart = date('Y-m-01');

        // Get pending test requests (only after payment is paid - accountant must process payment first)
        $pendingTests = $this->labRequestModel
            ->where('status', 'pending')
            ->where('payment_status', 'paid') // ONLY count after payment is PAID
            ->countAllResults();

        // Get completed tests today
        $completedToday = $this->labRequestModel
            ->where('status', 'completed')
            ->where('DATE(updated_at)', $today)
            ->countAllResults();

        // Get total tests this month
        $monthlyTests = $this->labRequestModel
            ->where('status', 'completed')
            ->where('DATE(updated_at) >=', $monthStart)
            ->countAllResults();

        // Get pending specimens (lab requests with status pending or in_progress, only after payment is paid)
        $pendingSpecimens = $this->labRequestModel
            ->whereIn('status', ['specimen_collected', 'in_progress'])
            ->where('payment_status', 'paid') // ONLY count after payment is PAID
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `lab_requests`
WHERE `status` = 'pending'
AND `payment_status` = 'paid'
SELECT COUNT(*) AS `numrows`
FROM `lab_requests`
WHERE `status` = 'completed'
AND DATE(updated_at) = '2025-12-03'
SELECT COUNT(*) AS `numrows`
FROM `lab_requests`
WHERE `status` = 'completed'
AND DATE(updated_at) >= '2025-12-01'
SELECT COUNT(*) AS `numrows`
FROM `lab_requests`
WHERE `status` IN ('specimen_collected','in_progress')
AND `payment_status` = 'paid'

    public function completedTests()
    {
        // Check if user is logged in and is lab staff
        $isLoggedIn = session()->get('isLoggedIn') || session()->get('logged_in');
        $userRole = session()->get('role');
        if (!$isLoggedIn || !in_array($userRole, ['labstaff', 'lab_staff', 'admin'])) {
            return redirect()->to('/auth')->with('error', 'You must be logged in as lab staff to access this page.');
        }

        $db = \Config\Database::connect();

        // Get completed tests with results
        $completedTests = $db->table('lab_requests')
            ->select('lab_requests.*,
                admin_patients.firstname as patient_firstname,
                admin_patients.lastname as patient_lastname,
                admin_patients.contact as patient_contact,
                doctor.username as doctor_name,
                nurse.username as nurse_name,
                lab_results.result as test_result,
                lab_results.result_file,
                lab_results.interpretation,
                lab_results.completed_at,
                completed_by.username as completed_by_name')
            ->join('admin_patients', 'admin_patients.id = lab_requests.patient_id', 'left')
            ->join('users as doctor', 'doctor.id = lab_requests.doctor_id', 'left')
            ->join('users as nurse', 'nurse.id = lab_requests.nurse_id', 'left')
            ->join('lab_results', 'lab_results.lab_request_id = lab_requests.id', 'left')
            ->join('users as completed_by', 'completed_by.id = lab_results.completed_by', 'left')
            ->where('lab_requests.status', 'completed')
            ->orderBy('lab_requests.updated_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `lab_requests`.*, `admin_patients`.`firstname` as `patient_firstname`, `admin_patients`.`lastname` as `patient_lastname`, `admin_patients`.`contact` as `patient_contact`, `doctor`.`username` as `doctor_name`, `nurse`.`username` as `nurse_name`, `lab_results`.`result` as `test_result`, `lab_results`.`result_file`, `lab_results`.`interpretation`, `lab_results`.`completed_at`, `completed_by`.`username` as `completed_by_name`
FROM `lab_requests`
LEFT JOIN `admin_patients` ON `admin_patients`.`id` = `lab_requests`.`patient_id`
LEFT JOIN `users` as `doctor` ON `doctor`.`id` = `lab_requests`.`doctor_id`
LEFT JOIN `users` as `nurse` ON `nurse`.`id` = `lab_requests`.`nurse_id`
LEFT JOIN `lab_results` ON `lab_results`.`lab_request_id` = `lab_requests`.`id`
LEFT JOIN `users` as `completed_by` ON `completed_by`.`id` = `lab_results`.`completed_by`
WHERE `lab_requests`.`status` = 'completed'
ORDER BY `lab_requests`.`updated_at` DESC