app/Controllers/Auth.php


        // Get user role
        $db = \Config\Database::connect();
        $role = $db->table('roles')
                  ->where('id', $user['role_id'])
                  ->get()
                  ->getRowArray();
---
SELECT *
FROM `roles`
WHERE `id` = '1'