app/Controllers/Auth.php

    public function process()
    {
        // Enable error reporting for debugging
        error_reporting(E_ALL);
        ini_set('display_errors', 1);

        $session = session();
        $request = service('request');

        // Log raw POST data
        log_message('debug', 'Raw POST data: ' . file_get_contents('php://input'));

        // Get form data
        $username = $request->getPost('username');
        $password = $request->getPost('password');

        // Debug: Log the login attempt
        log_message('debug', "Login attempt - Username: {$username}");
        log_message('debug', 'POST data: ' . print_r($this->request->getPost(), true));

        if (empty($username) || empty($password)) {
            log_message('error', 'Empty username or password');
            return redirect()->back()->withInput()->with('error', 'Please enter both username and password');
        }

        try {
            // Find user by username only
            $user = $this->userModel->where('username', $username)
                                  ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'sys.admin'
 LIMIT 1