app/Models/MedicalServiceModel.php

SELECT *
FROM `medical_services`
ORDER BY `service_name` ASC
---
    public function getAllServices($status = null, $category = null)
    {
        $builder = $this;

        if ($status) {
            $builder = $builder->where('status', $status);
        }

        if ($category) {
            $builder = $builder->where('category', $category);
        }

        return $builder->orderBy('service_name', 'ASC')->findAll();