app/Controllers/Doctor/ConsultationController.php

SELECT *
FROM `doctor_schedules`
WHERE `doctor_id` = '2'
AND `shift_date` >= '2025-01-01'
AND `shift_date` <= '2025-12-31'
AND `status` != 'cancelled'
ORDER BY `shift_date` ASC, `start_time` ASC
---
    public function mySchedule()
    {
        // Check if user is logged in and is a doctor
        if (!session()->get('logged_in') || session()->get('role') !== 'doctor') {
            return redirect()->to('/auth')->with('error', 'You must be logged in as a doctor to access this page.');
        }

        $doctorId = session()->get('user_id');
        $db = \Config\Database::connect();
        $scheduleModel = new \App\Models\DoctorScheduleModel();

        // Check if table exists
        if (!$db->tableExists('doctor_schedules')) {
            return redirect()->back()->with('error', 'Doctor schedules table does not exist. Please contact administrator to run migrations.');
        }

        // Generate 1-year schedule if not exists
        $this->generateYearlySchedule($doctorId);

        // Get all schedules for the current year, grouped by month
        $currentYear = date('Y');
        $startDate = $currentYear . '-01-01';
        $endDate = $currentYear . '-12-31';

        $schedules = $db->table('doctor_schedules')
            ->where('doctor_id', $doctorId)
            ->where('shift_date >=', $startDate)
            ->where('shift_date <=', $endDate)
            ->where('status !=', 'cancelled')
            ->orderBy('shift_date', 'ASC')
            ->orderBy('start_time', 'ASC')
            ->get()
            ->getResultArray();

SELECT `a`.*, `ap`.`firstname`, `ap`.`lastname`, `ap`.`contact`, `r`.`room_number`, `r`.`ward`
FROM `admissions` `a`
LEFT JOIN `admin_patients` `ap` ON `ap`.`id` = `a`.`patient_id`
LEFT JOIN `rooms` `r` ON `r`.`id` = `a`.`room_id`
WHERE `a`.`attending_physician_id` = '2'
AND `a`.`status` = 'admitted'
AND `a`.`discharge_status` = 'admitted'
AND `a`.`deleted_at` IS NULL
AND YEAR(a.admission_date) = '2025'
ORDER BY `a`.`admission_date` ASC
---

        // Get from admissions table (admin_patients)
        if ($db->tableExists('admissions')) {
            $admittedFromAdmin = $db->table('admissions a')
                ->select('a.*, ap.firstname, ap.lastname, ap.contact, r.room_number, r.ward')
                ->join('admin_patients ap', 'ap.id = a.patient_id', 'left')
                ->join('rooms r', 'r.id = a.room_id', 'left')
                ->where('a.attending_physician_id', $doctorId)
                ->where('a.status', 'admitted')
                ->where('a.discharge_status', 'admitted')
                ->where('a.deleted_at', null)
                ->where('YEAR(a.admission_date)', $currentYear)
                ->orderBy('a.admission_date', 'ASC')
                ->get()
                ->getResultArray();

SELECT `p`.*, `r`.`room_number`, `r`.`ward`, `r`.`room_type`
FROM `patients` `p`
LEFT JOIN `rooms` `r` ON `r`.`id` = `p`.`room_id`
WHERE `p`.`doctor_id` = '2'
AND `p`.`type` = 'In-Patient'
AND `p`.`doctor_id` IS NOT NULL
AND `p`.`doctor_id` != 0
AND (YEAR(p.admission_date) = 2025 OR YEAR(p.created_at) = 2025 OR p.admission_date IS NULL)
ORDER BY `p`.`admission_date` ASC, `p`.`created_at` ASC
---

        // Get In-Patients from patients table (receptionist-registered)
        if ($db->tableExists('patients')) {
            $inPatientsRaw = $db->table('patients p')
                ->select('p.*, r.room_number, r.ward, r.room_type')
                ->join('rooms r', 'r.id = p.room_id', 'left')
                ->where('p.doctor_id', $doctorId)
                ->where('p.type', 'In-Patient')
                ->where('p.doctor_id IS NOT NULL')
                ->where('p.doctor_id !=', 0)
                ->where('(YEAR(p.admission_date) = ' . $currentYear . ' OR YEAR(p.created_at) = ' . $currentYear . ' OR p.admission_date IS NULL)', null, false)
                ->orderBy('p.admission_date', 'ASC')
                ->orderBy('p.created_at', 'ASC')
                ->get()
                ->getResultArray();