app/Controllers/Doctor/PatientController.php

            $isAvailable = false;

            if ($db->tableExists('nurse_schedules')) {
                $schedule = $db->table('nurse_schedules')
                    ->where('nurse_id', $nurseId)
                    ->where('shift_date', $date)
                    ->where('status', 'active')
                    ->get()
                    ->getRowArray();
---
SELECT *
FROM `nurse_schedules`
WHERE `nurse_id` = '17'
AND `shift_date` = '2025-12-14'
AND `status` = 'active'